import React from "react";
import { Comp } from "./Comp";
import { Comp1 } from "./Comp1";
import { Comp2 } from "./Comp2";

export const Home = () => {
  return (
    <div className="flex  md:px-[1%] sm:px-[1%]  ">
      <div className=" flex xs:w-[100%] sm:w-[100%] md:w-[100%] w-[68%]  xs:mx-[1%]">
        <div className="  lg:border-r-2 xl:border-r-2 2xl:border-r-2 mt-6   border-gray-400">
          <div className="">
            <Comp
              path="/news"
              btn="कानून व्यवस्था"
              img="/img/mg12.webp"
              heading="डिजिटल साइन करने महिला पटवारी 
ने मांगी रिश्वत; एसडीएम ने 
शुरु की जांच"
              paira="रायपुर। Raipur News इन दिनों राजधानी
सहित प्रदेशभर में पटवारियों द्वारा बिना रिश्वत
 लेने की शिकायतें आम हो चुकी हैं। ऐसा ही
 एक मामला प्रदेश की राजधानी में भी सामन
े आया है। जिसकी शिकायत कलेक्टर तक
पहुंच गई है। सोमवार को हुई जनचौपाल में
एक किसान ने महिला पटवारी द्वारा डिजीटल
साइन करने के एवज में रिश्वत मांगने की
शिकायत की है।"
            />
          </div>
          <hr className="h-0.5 bg-gray-700 mx-5 my-6 " />
          <div className="">
            <Comp
            path="/rajniti"
              btn="राजनीति"
              img="/img/mg2.webp"
              heading="राहुल गाधी के समर्थन में रायपुर-
बिलासपुर राष्ट्रीय राजमार्ग पर प्रदर्शन
-चक्का जाम; 600 कार्यकर्ता गिरफ्तार"
              paira="रायपुर, लोकतंत्र की रक्षा के लिए और अडानी 
के खिलाफ आवाज उठाने पर कांग्रेस नेता
राहुल गांधी की संसद सदस्यता केंद्र की भाजपा
सरकार ने समाप्त कर दी। इसके खिलाफ कांग्रेस 
प्रदेश प्रतिनिधि सुनील माहेश्वरी के नेतृत्व में केंद्र
की मोदी सरकार के खिलाफ रायपुर-बिलासपुर
सिक्स लेन में सिमगा मोड़ पर धरना प्रदर्शन
किया गया ।"
            />
          </div>
          <hr className="h-0.5 bg-gray-700 mx-5 my-6 " />
          <div className="">
            <Comp
            path="/news"
              btn="राज्यशासन"
              img="/img/mg12.webp"
              heading="छत्तीसगढ प्रेम; राजस्थान के चिकित्सकों-
कर्मचारियों ने एम्स में दिया 103 यूनिट रक्त"
              paira="रायपुर, खिल भारतीय आयुर्विज्ञान संस्थान में
राजस्थान के कर्मचारियों की ओर से रक्तदान
शिविर आयोजित किया गया। इसमें चिकित्सकों,
अधिकारियों और कर्मचारियों की ओर से 103
यूनिट रक्तदान हुआ।"
            />
          </div>
          <hr className="h-0.5 bg-gray-700 mx-5 my-6 " />
          <div className="">
            <Comp
            path="/rajniti"
              btn="राजनीति"
              img="/img/logo4.webp"
              heading="6 अप्रैल को भाजपा का स्थापना दिवस;
प्रधानमंत्री मोदी करेंगे संबोधित"
              paira="रायपुर, भारतीय जनता पार्टी के स्थापना
दिवस पर होने वाले वृहद कार्यक्रमों की
रूपरेखा पर प्रकाश डालते हुए छत्तीसगढ़
प्रदेश भाजपा महामंत्री ओपी चौधरी ने
कहा कि पूरे राज्य में भाजपा का स्थापना
दिवस ऐतिहासिक रूप से मनाया जाएगा।"
            />
          </div>
        </div>
      </div>
      <div className="xs:hidden sm:hidden md:hidden xs:w-[0%] sm:w-[0%] md:w-[0%] lg:w-[32%] xl:w-[32%] 2xl:w-[32%]">
        <div className=" ">
          <Comp1 />
        </div>
        <div className="">
          <Comp2 />
        </div>
      </div>
    </div>
  );
};
